tap "hashicorp/tap"
tap "homebrew/services"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "twilio/brew"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Cloud-native high-performance edge/middle/service proxy
brew "envoy"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Utility to optimize JPEG files
brew "jpegoptim"
# Command-line interface to LiveKit
brew "livekit-cli"
# Open source relational database management system
brew "mysql"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Platform built on V8 to build network applications
brew "node"
# PNG file optimizer
brew "optipng"
# Open-source vector similarity search for Postgres
brew "pgvector"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@14"
# It's not just a linter that annoys you!
brew "pylint"
# Rsync for cloud storage
brew "rclone"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Persistent key-value database, with built-in net interface
brew "redis"
# Command-line interface for Render
brew "render"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Strong open-source chess engine
brew "stockfish"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# unleash the power of Twilio from your command prompt
brew "twilio/brew/twilio"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-lato"
cask "font-montserrat"
cask "font-nunito"
cask "font-open-sans"
cask "font-oswald"
cask "font-poppins"
cask "font-raleway"
cask "font-roboto"
cask "font-source-code-pro"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "alexcvzz.vscode-sqlite"
vscode "alexisvt.flutter-snippets"
vscode "attilabuti.vscode-mjml"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "continue.continue"
vscode "csstools.postcss"
vscode "cweijan.xmind-viewer"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "devmuaz.flutterhookssnippets"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jonkwheeler.styled-components-snippets"
vscode "localizely.flutter-intl"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mthuong.vscode-flutter-freezed-helper"
vscode "naco-siren.gradle-language"
vscode "nash.awesome-flutter-snippets"
vscode "naumovs.color-highlight"
vscode "phind.phind"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "ritwickdey.liveserver"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "simonsiefke.svg-preview"
vscode "styled-components.vscode-styled-components"
vscode "sumeetpardeshi.ports-manager"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
uv "gemini-cli"
npm "@fission-ai/openspec"
npm "prettier"
